ldos-app-embeddings/socialNetwork/kubernetes/runs/e2e-compose-post-1-nDbD/output.txt
Running 30s test @ http://localhost:32000/wrk2-api/post/compose
  4 threads and 32 connections

  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
[...]
reconnect_socket
reconnect_socket
reconnect_socket
[...]
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:32000/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.76s     5.54s   26.26s    46.38%
    Req/Sec     0.89     11.06     0.00     99.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.92s 
 75.000%   20.00s 
 90.000%   20.02s 
 99.000%   26.26s 
 99.900%   26.38s 
 99.990%   26.38s 
 99.999%   26.38s 
100.000%   26.38s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000           10         1.00
   10002.431     0.100000           10         1.11
   10010.623     0.200000           32         1.25
   10010.623     0.300000           32         1.43
   10010.623     0.400000           32         1.67
   19922.943     0.500000           36         2.00
   19955.711     0.550000           40         2.22
   19972.095     0.600000           47         2.50
   19972.095     0.650000           47         2.86
   19988.479     0.700000           50         3.33
   20004.863     0.750000           58         4.00
   20004.863     0.775000           58         4.44
   20004.863     0.800000           58         5.00
   20004.863     0.825000           58         5.71
   20021.247     0.850000           62         6.67
   20021.247     0.875000           62         8.00
   20021.247     0.887500           62         8.89
   20054.015     0.900000           63        10.00
   20054.015     0.912500           63        11.43
   20152.319     0.925000           64        13.33
   23035.903     0.937500           65        16.00
   26083.327     0.943750           66        17.78
   26083.327     0.950000           66        20.00
   26083.327     0.956250           66        22.86
   26181.631     0.962500           67        26.67
   26181.631     0.968750           67        32.00
   26263.551     0.971875           68        35.56
   26263.551     0.975000           68        40.00
   26263.551     0.978125           68        45.71
   26263.551     0.981250           68        53.33
   26263.551     0.984375           68        64.00
   26378.239     0.985938           69        71.11
   26378.239     1.000000           69          inf
#[Mean    =    15757.965, StdDeviation   =     5542.721]
#[Max     =    26361.856, Total count    =           69]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  69 requests in 30.01s, 24.06KB read
  Socket errors: connect 0, read 0, write 0, timeout 39
  Non-2xx or 3xx responses: 69
Requests/sec:      2.30  
Transfer/sec:     820.79B